EDT/ZUP/zup_edt/src/Documents/ОбучениеРазвитиеСотрудников/ОбучениеРазвитиеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбучениеРазвитиеСотрудников</name>
  <basedOn>Document.ОбучениеРазвитиеСотрудников</basedOn>
  <basedOn>Document.ЗаявкаНаОбучениеРазвитие</basedOn>
  <basedOn>Document.ПубликацияМероприятияОбученияРазвития</basedOn>
  <basedOn>Catalog.МероприятияОбученияРазвития</basedOn>
  <registerRecords>InformationRegister.ОбучениеСотрудников</registerRecords>
  <registerRecords>InformationRegister.ЭлектронныеКурсыСотрудников</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.МероприятияОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчебныхЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеРазвитие</types>
      <types>DocumentRef.ПубликацияМероприятияОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйЭтапОбучения</name>
    <type>
      <types>DocumentRef.ОбучениеРазвитиеСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.ОценкиОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийКОценке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьКомпетенции</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Catalogs/МероприятияОбученияРазвития/МероприятияОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МероприятияОбученияРазвития</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВАрхиве</name>
    <comment>Помещено в архив</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.ВидыМероприятияОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроведения</name>
    <comment>Внутренний/внешний</comment>
    <type>
      <types>EnumRef.СпособыПроведенияМероприятийОбученияРазвития</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбучениеСОтрывомОтПроизводства</name>
    <comment>Внутренний/внешний</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчебныхЧасов</name>
    <comment>Длительность курса в часах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСлушателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <comment>Место проведения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимости</name>
    <type>
      <types>EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебноеЗаведение</name>
    <type>
      <types>CatalogRef.УчебныеЗаведения</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаОбОбразовании</name>
    <comment>Вид выдаваемого документа после обучения</comment>
    <type>
      <types>CatalogRef.ВидыДокументовОбОбразовании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисваиваемаяСпециальность</name>
    <comment>Присваиваемая специальность</comment>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаЗачета</name>
    <type>
      <types>CatalogRef.ФормыЗачетаМероприятийОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаключатьУченическийДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьКомпетенции</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обязательства</name>
    <attributes>
      <name>ПериодРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтудентРаботающийВСтудотряде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/Documents/ОбучениеРазвитиеСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс		
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	// Ограничения доступа в ролях:
	// Чтение / Изменение:
	// #ПоЗначениямРасширенный( "Документ.<ИмяДокумента>", "","","",
	// "НЕ Ложь В (Выбрать Первые 1 Ложь Из Документ.<ИмяДокумента>.ФизическиеЛица КАК Т1 ГДЕ Т.Ссылка = Т1.Ссылка И НЕ (",
	// "ГруппыФизическихЛиц", "Т1.ФизическоеЛицо", "))",
	// "","", "","","", "", "","", "", "","","", "","","", "","","", "","","", "","","", "","","", "","","", "","","",
	// "","","", "","","", "","","", "","","")
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо))";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ОбучениеРазвитиеСотрудников;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Процедура ЗаполнитьПервичныйЭтап(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОбучениеРазвитиеСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|ГДЕ
		|	ОбучениеРазвитиеСотрудников.ПервичныйЭтапОбучения = ЗНАЧЕНИЕ(Документ.ОбучениеРазвитиеСотрудников.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ОбучениеРазвитиеСотрудников", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ПервичныйЭтапОбучения = Выборка.Ссылка;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Выборка.Количество() = 0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения(Ссылка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбучениеРазвитиеСотрудников.ДатаНачала КАК Период,
		|	ОбучениеРазвитиеСотрудников.ДатаОкончания КАК ДоступенДо,
		|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МероприятияОбученияРазвития.ЭлектронныйКурс КАК ЭлектронныйКурс,
		|	ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников.Сотрудники КАК ОбучениеРазвитиеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МероприятияОбученияРазвития КАК МероприятияОбученияРазвития
		|			ПО ОбучениеРазвитиеСотрудников.Мероприятие = МероприятияОбученияРазвития.Ссылка
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Ссылка = ОбучениеРазвитиеСотрудников.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник = СправочникСотрудники.Ссылка
		|ГДЕ
		|	ОбучениеРазвитиеСотрудников.Ссылка = &Ссылка
		|	И МероприятияОбученияРазвития.СпособПроведения = ЗНАЧЕНИЕ(Перечисление.СпособыПроведенияМероприятийОбученияРазвития.ЭлектронныйКурс)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбучениеРазвитиеСотрудников.Подразделение КАК Подразделение,
		|	ОбучениеРазвитиеСотрудников.Мероприятие КАК Мероприятие,
		|	ОбучениеРазвитиеСотрудников.ДатаНачала КАК ДатаНачала,
		|	ОбучениеРазвитиеСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	СправочникСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОбучениеРазвитиеСотрудников.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	ОбучениеРазвитиеСотрудниковСотрудники.СуммаНаСотрудника КАК СуммаРасходов,
		|	МероприятияОбученияРазвития.УчебноеЗаведение КАК УчебноеЗаведение,
		|	ВЫРАЗИТЬ(МероприятияОбученияРазвития.Преподаватель КАК Справочник.Сотрудники).ФизическоеЛицо КАК Преподаватель,
		|	ОбучениеРазвитиеСотрудников.Контрагент КАК Контрагент,
		|	ОбучениеРазвитиеСотрудников.ПервичныйЭтапОбучения КАК ПервичныйЭтапОбучения,
		|	ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА МероприятияОбученияРазвития.ФормаЗачета = ЗНАЧЕНИЕ(Справочник.ФормыЗачетаМероприятийОбучения.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ ОценкиОбучения.Ссылка
		|	КОНЕЦ КАК Оценка,
		|	ВЫБОР
		|		КОГДА МероприятияОбученияРазвития.ФормаЗачета = ЗНАЧЕНИЕ(Справочник.ФормыЗачетаМероприятийОбучения.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ ОценкиОбучения.Балл
		|	КОНЕЦ КАК Балл,
		|	ВЫБОР
		|		КОГДА МероприятияОбученияРазвития.ФормаЗачета = ЗНАЧЕНИЕ(Справочник.ФормыЗачетаМероприятийОбучения.ПустаяСсылка)
		|			ТОГДА NULL
		|		ИНАЧЕ ОбучениеРазвитиеСотрудниковСотрудники.КомментарийКОценке
		|	КОНЕЦ КАК КомментарийКОценке
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников.Сотрудники КАК ОбучениеРазвитиеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОценкиОбучения КАК ОценкиОбучения
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Оценка = ОценкиОбучения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МероприятияОбученияРазвития КАК МероприятияОбученияРазвития
		|			ПО ОбучениеРазвитиеСотрудников.Мероприятие = МероприятияОбученияРазвития.Ссылка
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Ссылка = ОбучениеРазвитиеСотрудников.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник = СправочникСотрудники.Ссылка
		|ГДЕ
		|	ОбучениеРазвитиеСотрудников.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА МероприятияОбученияРазвития.ФормаЗачета = ЗНАЧЕНИЕ(Справочник.ФормыЗачетаМероприятийОбучения.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ОбучениеРазвитиеСотрудниковСотрудники.Оценка = ЗНАЧЕНИЕ(Справочник.ОценкиОбучения.ПустаяСсылка)
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатЭлектронныхКурсов = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2];
	РезультатОбучения = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ЭлектронныеКурсы", РезультатЭлектронныхКурсов.Выгрузить());
	ДанныеДляПроведения.Вставить("ДвиженияОбучения", РезультатОбучения.Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
